Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::ElementBase Class Reference
MEP Element Manager
#include <MEPElementBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::ElementBase:
 Public Member Functions
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Protected Member Functions
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Detailed Description
It is a collection of common MEP attributes that can be handled through this parent entity.
Since
Archicad 27
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::v1::ElementBase::Exists  |  ( |   | ) |   const
Returns
Checks if the element still exists.
◆ GetAnchorPoint()
 API_Coord3D ACAPI::MEP::v1::ElementBase::GetAnchorPoint  |  ( |   | ) |   const
Returns
Returns the anchor point of the element.
◆ GetDirectConnectedMEPElementIds()
 std::vector< UniqueID > ACAPI::MEP::v1::ElementBase::GetDirectConnectedMEPElementIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the connected MEP elements.
◆ GetObjectId()
 API_Guid ACAPI::MEP::v1::ElementBase::GetObjectId  |  ( |   | ) |   const
Returns
Returns the main GUID of the referenced Library Part.
◆ GetOrientation()
 Orientation ACAPI::MEP::v1::ElementBase::GetOrientation  |  ( |   | ) |   const
Returns
Returns the orientation of the element, which is based on a direction vector and a rotation vector.
◆ GetPortIDs()
 std::vector< UniqueID > ACAPI::MEP::v1::ElementBase::GetPortIDs  |  ( |   | ) |   const
Returns
Returns the IDs of the element's ports.